&НаСервереБезКонтекста
Функция ПолучитьФирмуМодели(СсылкаНаМодель)
   Возврат СсылкаНаМодель.Фирма;
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьВидОборудованияМодели(СсылкаНаМодель)
   Возврат СсылкаНаМодель.ВидОборудования;
КонецФункции 

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	//TODO:
	//добавить первым элементом комплектации номенклатуру из модели
	Если Объект.Комплектация.Количество() = 0 Тогда
		ТЧ = Объект.Комплектация.Добавить();
		ТЧ.Номенклатура = Объект.Модель;
		ТЧ.Количество = 1;
	КонецЕсли;
	Объект.Фирма = ПолучитьФирмуМодели(Объект.Модель);
	Объект.ВидОборудования = ПолучитьВидОборудованияМодели(Объект.Модель);
	//Объект.Комплектация.
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Оплата1ПриНачалеРедактированияНаСервере()
	Возврат Перечисления.ВидыРасчета.РасчетПоФакту;
КонецФункции

&НаКлиенте
Процедура Оплата1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Элемент.ТекущиеДанные.Сумма = 1;
КонецПроцедуры

&НаКлиенте
Процедура Оплата1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда

        Элемент.ТекущиеДанные.ВидРасчета = Оплата1ПриНачалеРедактированияНаСервере();
		Элемент.ТекущиеДанные.Дата = ТекущаяДата();
		Элемент.ТекущиеДанные.Сумма = 0;

    КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтапыРабот1ПриОкончанииРедактированияНаСервере()
	Возврат Перечисления.ЗаявкаНаРемонт_Статусы.ВРаботе;
КонецФункции

&НаКлиенте
Процедура ЭтапыРабот1ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		Объект.Статус = ЭтапыРабот1ПриОкончанииРедактированияНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Гарантийный Тогда
		Элементы.Оплата.Видимость = Истина;
	Иначе 
		Элементы.Оплата.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.Проведен И Объект.Статус = Перечисления.ЗаявкаНаРемонт_Статусы.Закрыто Тогда
		ЭтаФорма.ТолькоПросмотр = ИСТИНА;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Оплата1ПриИзменении(Элемент)
	Объект.СуммаОплат = Объект.Оплата.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ГарантийныйПриИзменении(Элемент)
	Если Объект.Гарантийный Тогда
		Элементы.Оплата.Видимость = Ложь;
	Иначе
		Элементы.Оплата.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаЧС(Телефон)
	РезультаЗапроса = Новый Запрос;
		РезультаЗапроса.Параметры.Вставить("Телефон", Телефон);
		РезультаЗапроса.Текст =
		"ВЫБРАТЬ
		|	Телефоны_ЧС.КонтактныйТелефон КАК КонтактныйТелефон
		|ИЗ
		|	РегистрСведений.Телефоны_ЧС КАК Телефоны_ЧС
		|ГДЕ
		|	Телефоны_ЧС.КонтактныйТелефон = &Телефон";
		//РезультаЗапроса.Выполнить(); 
		Если НЕ РезультаЗапроса.Выполнить().Пустой() Тогда
			Возврат ИСТИНА
		Иначе
			Возврат ЛОЖЬ
		КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Контакт ЧС
	//Сообщить("Привет!");
	//ТЧ = Объект.КонтактыйТелефон;
	//Для Каждого Телефон из ТЧ Цикл
		//Если Телефон.НомерТелефона В РегистрыСведений.Телефоны_ЧС
		
	//	Если ВыполнитьЗапрос(Телефон) Тогда
		//РезультаЗапроса = Новый Запрос;
		//РезультаЗапроса.Параметры.Вставить("Телефон", Телефон.НомерТелефона);
		//РезультаЗапроса.Текст =
		//"ВЫБРАТЬ
		//|	Телефоны_ЧС.КонтактныйТелефон КАК КонтактныйТелефон
		//|ИЗ
		//|	РегистрСведений.Телефоны_ЧС КАК Телефоны_ЧС
		//|ГДЕ
		//|	Телефоны_ЧС.КонтактныйТелефон = &Телефон";
		////РезультаЗапроса.Выполнить(); 
		//Если НЕ РезультаЗапроса.Выполнить().Пустой() Тогда
	//		Если НЕ Вопрос("Контакт " + Телефон.НомерТелефона + " содержится в черном списке! Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Внимание!", КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да  Тогда 
	// 			Отказ = ИСТИНА;
	//			Сообщить("Контакт " + Телефон.НомерТелефона + " содержится в черном списке!");
	//			Прервать;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КонтактыйТелефонНомерТелефонаПриИзменении(Элемент)
	//Телефон = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.НомерТелефона;
	//Если ПроверкаЧС(Телефон) Тогда
	//	Если НЕ Вопрос("Контакт " + Телефон + " содержится в черном списке! Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Внимание!", КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да  Тогда 
	// 		//Отказ = ИСТИНА;
	//		Сообщить("Контакт " + Телефон + " содержится в черном списке!");
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтактыйТелефонПриИзменении(Элемент)
//	Телефон = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.НомерТелефона;
КонецПроцедуры

&НаКлиенте
Процедура КонтактыйТелефонПередНачаломИзменения(Элемент, Отказ)
	//Сообщить("Привет!");
КонецПроцедуры

&НаКлиенте
Процедура КонтактыйТелефонПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Телефон = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.НомерТелефона;
	Если ПроверкаЧС(Телефон) Тогда
		Если НЕ Вопрос("Контакт " + Телефон + " содержится в черном списке! Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Внимание!", КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да  Тогда 
	 		Отказ = ИСТИНА;
			//Сообщить("Контакт " + Телефон + " содержится в черном списке!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятьЗапретРедактированияДокумента(Команда)
	РазрешитьРедактированиеДокументаСервер();
КонецПроцедуры

&НаСервере
Процедура РазрешитьРедактированиеДокументаСервер()
	ОбщегоНазначения.УстановитьВозможностьРедактированияФормы(ЭтаФорма);
КонецПроцедуры
