
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Товары.Количество() > 0 Тогда
		    //Регистр ДДС
			Движения.ДвиженияДенежныхСредств.Записывать = Истина;
			Движения.ОстаткиНоменклатуры.Записывать = Истина;
			Движения.Продажи.Записывать = Истина;
			
			Движение = Движения.ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата;
			Движение.Сумма = +СуммаДокумента; //Доход
			Движение.СтатьяДвиженияДенежныхСредств = ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ПриемВыручки");
			
			

		
			Для Каждого Товар Из Товары Цикл
				// регистр ОстаткиНоменклатуры
				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = Товар.Номенклатура;
				Движение.Количество = Товар.Количество;
				
				//Регистр Продажи
				Движение = Движения.Продажи.Добавить();
				Движение.Период = Дата;
				Движение.Контрагент = Контрагент;
				Движение.Номенклатура = Товар.Номенклатура;
				Движение.Сумма = Товар.Сумма;
				Движение.Количество = Товар.Количество;
			КонецЦикла;
		
	Иначе
		Сообщить("Не указаны поступившие товары!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказТоваров") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ЗаказТоваров = ДанныеЗаполнения.Ссылка;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		СуммаДокумента = 0;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			СуммаДокумента = СуммаДокумента + НоваяСтрока.Сумма;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
