
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьЗаявки)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаявки(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаявки(ТабДок, ПараметрКоманды)
	Документы.ЗаявкаНаРемонт.ПечатьЗаявки(ТабДок, ПараметрКоманды);
КонецПроцедуры
