
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		ЭтотОбъект.Фирма = ДанныеЗаполнения.Родитель.Фирма;
		ЭтотОбъект.ВидОборудования = ДанныеЗаполнения.Родитель.ВидОборудования;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЭтоГруппа Тогда
		ПроверяемыеРеквизиты.Добавить("Фирма");
		ПроверяемыеРеквизиты.Добавить("ВидОборудования");
	КонецЕсли;
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	//	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл
	//	
	//	Если (ЗаписьРегистра.Комплектующая = ЗаписьРегистра.Номенклатура)
	//		И ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
	//		
	//		ТекстОшибки = НСтр("ru = 'Номенклатура не может совпадать с комплектующей'");
	//		
	//		Сообщить(ТекстОшибки);
	//		Отказ = ИСТИНА;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;

КонецПроцедуры

