
&НаКлиенте
Процедура ЗаполнитьНачальнымиДанными(Команда)
	ЗаполнитьНачальнымиДаннымиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНачальнымиДаннымиНаСервере()
	Константы.АдресAPIBinance.Установить("api.binance.com");
	Константы.АдресAPIEthermine.Установить("api.ethermine.org");
	Константы.АдресAPIHive.Установить("api2.hiveos.farm");
	Константы.АдресAPINiceHash.Установить("api2.nicehash.com");
	Константы.АдресAPIPolygonscan.Установить("api.polygonscan.com");
КонецПроцедуры
