
Процедура ПечатьЗаявки(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьЗаявки)
	Макет = Документы.ЗаявкаНаРемонт.ПолучитьМакет("ПечатьЗаявки");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРемонт.ВидОборудования,
	|	ЗаявкаНаРемонт.Дата,
	|	ЗаявкаНаРемонт.Клиент,
	|	ЗаявкаНаРемонт.Модель,
	|	ЗаявкаНаРемонт.Неисправность,
	|	ЗаявкаНаРемонт.Номер,
	|	ЗаявкаНаРемонт.Комплектация.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество
	|	)
	|ИЗ
	|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|ГДЕ
	|	ЗаявкаНаРемонт.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКомплектацияШапка = Макет.ПолучитьОбласть("КомплектацияШапка");
	ОбластьКомплектация = Макет.ПолучитьОбласть("Комплектация");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьКомплектацияШапка);
		ВыборкаКомплектация = Выборка.Комплектация.Выбрать();
		Пока ВыборкаКомплектация.Следующий() Цикл
			ОбластьКомплектация.Параметры.Заполнить(ВыборкаКомплектация);
			ТабДок.Вывести(ОбластьКомплектация, ВыборкаКомплектация.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
