
Процедура ОбработкаПроведения(Отказ, Режим) 
	// регистр Выручка 
	Если Статус = Перечисления.ЗаявкаНаРемонт_Статусы.Закрыто И НЕ Гарантийный Тогда
		Движения.Выручка.Записывать = Истина;
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.Оборудование = Модель;
		Движение.Сумма = СуммаОплат;
		
	// регистр ДвиженияДенежныхСредств
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.СтатьяДвиженияДенежныхСредств = ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ПриемВыручки");
		Движение.Сумма = +СуммаОплат;
	КонецЕсли;

КонецПроцедуры 

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
		Префикс = ЭтотОбъект.Модель.Фирма.Код;
		
	//Если СтрНайти(ЭтотОбъект.Номер, КодФирмы) <> 1 Тогда 
	//	ЭтотОбъект.Номер = КодФирмы+"-"+Прав(ЭтотОбъект.Номер,10-(СтрДлина(КодФирмы)+1));
	//КонецЕсли;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
		// Заполнение шапки
		ВидОборудования = ДанныеЗаполнения.ВидОборудования;
		Клиент = ДанныеЗаполнения.Клиент;
		Модель = ДанныеЗаполнения.Модель;
		СерийныйНомер = ДанныеЗаполнения.СерийныйНомер;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Фирма = ДанныеЗаполнения.Фирма;
		Гарантийный = НЕ ДанныеЗаполнения.Гарантийный;
		Для Каждого ТекСтрокаКомплектация Из ДанныеЗаполнения.Комплектация Цикл
			НоваяСтрока = Комплектация.Добавить();
			НоваяСтрока.Количество = ТекСтрокаКомплектация.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаКомплектация.Номенклатура;
		КонецЦикла;
		Для Каждого ТекСтрокаКонтактыйТелефон Из ДанныеЗаполнения.КонтактыйТелефон Цикл
			НоваяСтрока = КонтактыйТелефон.Добавить();
			НоваяСтрока.НомерТелефона = ТекСтрокаКонтактыйТелефон.НомерТелефона;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

