
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Товары.Количество() > 0 Тогда
		// регистр ДвиженияДенежныхСредств 
		Если СуммаДокумента > 0 Тогда
			Движения.ДвиженияДенежныхСредств.Записывать = Истина;
			Движения.ОстаткиНоменклатуры.Записывать = Истина;
			Движение = Движения.ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата;
			Движение.Сумма = -СуммаДокумента; //Расход
			Движение.СтатьяДвиженияДенежныхСредств = ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику");
			
			//// регистр ОстаткиНоменклатуры
			//Для Каждого Товар Из Товары Цикл
			//	Движение = Движения.ОстаткиНоменклатуры.Добавить();
			//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			//	Движение.Период = Дата;
			//	Движение.Номенклатура = Товар.Номенклатура;
			//	Движение.Количество = Товар.Количество;
			//КонецЦикла;
		КонецЕсли;
	Иначе
		Сообщить("Не указаны товары!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры